import random
from typing import Final
from telegram import Update
from telegram.ext import Application, CommandHandler, MessageHandler, filters, ContextTypes

# Список строк из трека «ДИНАСТИЯ»
TRACK_LINES = ["Давалке МСК стреляю сиги — ковбой",
               "Я кинню тебя точно так же, только чуть-чуть другой",
               "Стеснялась всё снимать, окей, прикрой ебальник рукой",
               "Я смотрю в зеркало всё так же, но не стану собой",
               "Люблю Москву, но заебали все московские шалавы",
               "В уродстве вижу красоту",
               "В уродстве моя красота",
               "Теперь на «вы», ведь ты давно уже не та",
               "Давай я тебя порежу, а ты мне выстрелишь в лоб",
               "Мы психопаты (У-ау), флексим так, как будто завтра умрём",
               "Но это вряд ли, поймал (Фью)",
               "И белый дым, чё-то чернит потолок",
               "На время завязал, теперь",
               "Я курю так, как будто никогда не умел",
               "Чувство то, что я пиздец отупел",
               "Ты не стреляешь, давай дам прицел",
               "Сумма большая, как будто я даун",
               "Бро, не могу думать сегодня",
               "Ты всё ещё там, но не моя, ты всё ещё тут, но там не я",
               "Мы делаем много, но, честно, я знаю, что буду непонят",
               "Первый миллион",
                "Я первый чемпион, и мне стянуло кожу ртом",
                "Вильчинский знает толк в этом, мы снимем на iPhone",
                "Концерты из Уфы, мы пишем это на Samson",
                "Я помню, мама говорила: «Выкинь нахуй микрофон»",
                "Я первый чемпион, и мне стянуло кожу ртом",
                "Креатор знает толк в этом, мы снимем на iPhone (Е-е-а)",
                "Концерты из Москвы, мы пишем это на Samson",
                "Я помню, мама говорила: «Выкинь нахуй микрофон»",
                "Я мог остаться тенью, и всё было бы так же",
                "Но захотелось стучать выше этих многоэтажек",
                "Моя хуйня стала мамбл — так разбирай на цитаты",
                "Твой друг чё тоже стал рэпер? Но продаёт Золо… а! (Ву)",
                "Прости, но я немного на другом",
                "Если прощу тебя сейчас, то не прощу себя потом",
                "Да, мой диагноз — ненормальный, но психолог может врать",
                "Помню, показывал свой рэп, но тебе было наплевать",
                "А что сейчас? Забавно, как ты просишь со мной фотку",
                "Никакого мит-н-грита, максимум могу дать в глотку (М-м, а)",
                "Для меня стало нормальным слить пол-ляма на футболку",
                "Мой любимый рэпер в прошлом пиздит мои наработки (Упс)"
               ]


TOKEN: Final = '8863603723:AAFZca67V2pBLFVBcY_tVTQeP-z7x3nXoEY'
BOT_USERNAME: Final = '@dynasty_swaga_bot'

async def start_command(update: Update, context: ContextTypes.DEFAULT_TYPE):
    await update.message.reply_text(
        "Приветствую тебя, my friend!\n"
        "Ты находишься в телеграмм-боте, созданном с целью того, чтобы выполнить "
        "задание для поступления в Информационный комитет. Этот бот генерирует случайную строчку "
        "из текста песни \"ДИНАСТИЯ\" – VILLIAN, madk1d."
        )
async def swaga_command(update: Update, context: ContextTypes.DEFAULT_TYPE):
     random_line = random.choice(TRACK_LINES)
     await update.message.reply_text(random_line)
def main():
   
    application = Application.builder().token(TOKEN).build()
    
   
    application.add_handler(CommandHandler("start", start_command))
    application.add_handler(CommandHandler("swaga", swaga_command))

    
    print("Бот успешно запущен и работает...")
    application.run_polling()

if __name__ == '__main__':
    main()